In [1]:
import pandas as pd
import numpy as np

import wrangle
import env

In [2]:
url = env.get_connection('mall_customers')
query = 'select * from customers'
df = pd.read_sql(query,url)

In [3]:
df.describe()sFG

       customer_id         age  annual_income  spending_score
count   200.000000  200.000000     200.000000      200.000000
mean    100.500000   38.850000      60.560000       50.200000
std      57.879185   13.969007      26.264721       25.823522
min       1.000000   18.000000      15.000000        1.000000
25%      50.750000   28.750000      41.500000       34.750000
50%     100.500000   36.000000      61.500000       50.000000
75%     150.250000   49.000000      78.000000       73.000000
max     200.000000   70.000000     137.000000       99.000000

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   customer_id     200 non-null    int64
 1   gender          200 non-null    object
 2   age             200 non-null    int64
 3   annual_income   200 non-null    int64
 4   spending_score  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [5]:
df = wrangle.assign_outlier(df,['age','annual_income','spending_score'])

age -1.625 79.375
annual_income -13.25 132.75
spending_score -22.625 130.375

In [6]:
wrangle.print_outliers(df)

,customer_id,gender,age,annual_income,spending_score,age_upper_outliers,age_lower_outliers,annual_income_upper_outliers,annual_income_lower_outliers,spending_score_upper_outliers,spending_score_lower_outliers
198,199,Male,32,137,18,0,0,1,0,0,0
199,200,Male,30,137,83,0,0,1,0,0,0

In [7]:
df = pd.read_sql(query,url) # Remove outlier columns

In [8]:
train, X_train, y_train, X_val, y_val, X_test, y_test = wrangle.split_data(df,'spending_score')

In [9]:
# Get dummies for 'gender' for all X sets
X_sets = [X_train,X_val,X_test]
X_new = []

for x in X_sets:
    X_new.append(pd.get_dummies(x,'gender'))

X_train, X_val, X_test = X_new

In [10]:
X_train,X_val,X_test = wrangle.scale_minmax(X_train,X_val,X_test)